package ToyStore.view;

public enum Templates {
    PAGE_EMPTY(
            """
            =============================================================
            |                                                           |
            |  ИСПЫТАЙ УДАЧУ                                            |
            |                                                           |
            =============================================================
            |                                                           |
            |  ДОБРО ПОЖАЛОВАТЬ!                                        |
            |  %20s                                     |
            |                                                           |
            =============================================================
            |                                                           |
            |    ТВОЙ СПИСОК ПРИЗОВ ПУСТ
            |                                                           |
            =============================================================
            """),
    PAGE(
            """
            =============================================================
            |                                                           |
            |        ИСПЫТАЙ УДАЧУ                                      |
            |                                                           |
            =============================================================
            |                                                           |
            |   ДОБРО ПОЖАЛОВАТЬ!                                       |
            |  %20s                                     |
            |                                                           |
            =============================================================
            |                                                           |
            |    ИГРУШКА:                                               |
            |              %-20s                         |
            |              %-25s                    |
            |    КОЛЛИЧЕСТВО:                                           |
            |              %-20s                         |
            |    ЦЕНА:                                                  |
            |              %-20s                         |
            |    УДАЧА:                                                 |
            |              %-20s                         |
            |    СТОЙМОСТЬ УДАЧИ                                        |
            |              %-20s                         |
            |                                                           |
            =============================================================
            """),
    PRIZE_RESULT(
            """
            |    --------------------------------------------------     |
            |    РЕЗУЛЬТАТ:                           %10s %-8s  |
            |                                                           |
            =============================================================
            """),
    PRIZE_TITLE_ITEM(
            """
            |                         ДЛЯ ОДНОГО      ВСЕГО             |
            |    #   НАЗВАНИЕ   КОЛЛИЧЕСТВО   ЦЕНА  УДАЧА ЦЕНА  УДАЧИ   |
            """),
    PRIZE_ITEM(
            """
            |    %-4s%-8s%-9s%-8s%-8s%-8s%-8s  |
            """),
    PRIZE_AMOUNT(
            """
            |                                                           |
            |    ВЫ ВЫЙГРАЛИ ПРИЗЫ:                                     |
            |             %8s items.                               |
            |                                                           |
            =============================================================
            """);

    private final String template;

    Templates(String template) {
        this.template = template;
    }
    public String getTemplate() {
        return template;
    }
}
